app/controllers/comments_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
---
  def index
    @post = Post.find(params[:post_id])

SELECT * FROM "posts" WHERE ("posts"."id" = 4)
SELECT * FROM "comments" WHERE ("comments"."id" = 1 AND ("comments".post_id = 4))
---
  def show
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])

SELECT * FROM "posts" WHERE ("posts"."id" = 4)
---
  def new
    @post = Post.find(params[:post_id])

SELECT * FROM "posts" WHERE ("posts"."id" = 4)
INSERT INTO "comments" ("created_at", "body", "updated_at", "post_id", "commenter") VALUES('2009-10-20 12:21:37', 'kommentinpoikanen', '2009-10-20 12:21:37', 4, 'jukkapekka')
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.new(params[:comment])

    if @comment.save      #tries to save