app/controllers/posts_controller.rb

  def index
    if session[:user_id].nil? # if not logged in
      @posts = Post.all_published # moved code from here to models
    else # if logged in
      @posts = Post.all.reverse
---
SELECT * FROM "posts" WHERE ("posts"."published" = 't')

  def create
    @user = User.find(session[:user_id])
    @post = @user.posts.new(params[:post])


    respond_to do |format|
      if @post.save
---
SELECT * FROM "users" WHERE ("users"."id" = 3)
INSERT INTO "posts" ("created_at", "title", "body", "updated_at", "published", "user_id", "user") VALUES('2009-10-22 12:36:51', 'anotherpostdfgsdf', 'sdfsdfanotherpost', '2009-10-22 12:36:51', 't', 3, NULL)

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 4)
UPDATE "posts" SET "updated_at" = '2009-10-20 10:32:25', "title" = 'jepjoo', "body" = 'noni - asdjfhas' WHERE "id" = 4