app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("salt", "created_at", "updated_at", "hashed_password", "email") VALUES('391500daae6a5224d4e54afc398c496b1f905b9bb390f343e7d991e8e2293350', '2009-10-22 08:34:39', '2009-10-22 08:34:39', '6e4e9681e736e62b410e732833b4efee43d8432b0e22464b836562b828b8cf28', 'bar@bar.com')